Repository: greyhound90/Mychatolic-app
Catalog: lib/l10n/app_*.arb
Languages: id

# commonLoading
source: Loading…
id: Memuat…

# commonErrorGeneric
source: Something went wrong.
id: Terjadi kesalahan.

# commonNoData
source: No data.
id: Tidak ada data.

# commonCancel
source: Cancel
id: Batal

# commonClose
source: Close
id: Tutup

# commonRetry
source: Retry
id: Coba Lagi

# commonSave
source: Save
id: Simpan

# commonBack
source: Back
id: Kembali

# commonNext
source: Next
id: Lanjut

# commonSubmit
source: Submit
id: Kirim

# loginTitle
source: Welcome back
id: Selamat Datang Kembali

# loginSubtitle
source: Sign in to continue your faith journey
id: Masuk untuk melanjutkan perjalanan imanmu

# emailHint
source: Enter your email
id: Masukkan email

# emailInvalidFormat
source: Invalid email format
id: Format email tidak valid

# passwordHint
source: Enter your password
id: Masukkan password

# confirmPasswordLabel
source: Confirm password
id: Konfirmasi Password

# confirmPasswordHint
source: Repeat your password
id: Ulangi password

# loginButton
source: Sign in
id: Masuk

# loginProcessing
source: Processing...
id: Memproses...

# loginNoAccount
source: Don't have an account?
id: Belum punya akun?

# loginGoToRegister
source: SIGN UP
id: DAFTAR

# loginForgotPassword
source: Forgot password?
id: Lupa Password?

# loginPasswordRequired
source: Please enter your password
id: Masukkan password anda

# loginEmailUnverified
source: Email is not verified. Check your inbox.
id: Email belum diverifikasi. Cek inbox Anda.

# loginProfileCorrupt
source: Profile data is corrupted. Please register again.
id: Data profil korup. Silakan daftar ulang.

# loginBannedTitle
source: Access denied
id: Akses Ditolak

# loginBannedMessage
source: Your account has been disabled/suspended. Please contact your parish admin for more info.
id: Akun Anda telah dinonaktifkan/ditangguhkan. Harap hubungi admin paroki untuk info lebih lanjut.

# loginInvalidCredentials
source: Email or password is incorrect.
id: Email atau sandi salah.

# loginNetworkError
source: Check your internet connection.
id: Periksa koneksi internet.

# loginUnknownError
source: An error occurred: {error}
id: Terjadi kesalahan: {error}

# registerTitleStep1
source: Create account
id: Buat Akun

# registerSubtitleStep1
source: Start your faith journey today.
id: Mulai perjalanan iman anda sekarang.

# registerTitleStep2
source: Personal info
id: Data Diri

# registerSubtitleStep2
source: Tell us a bit about you.
id: Beritahu kami sedikit tentang anda.

# registerTitleStep3
source: Location
id: Lokasi

# registerSubtitleStep3
source: Where do you attend church?
id: Dimana anda bergereja saat ini?

# registerTitleStep4
source: Role & status
id: Peran & Status

# registerSubtitleStep4
source: How do you serve in church?
id: Bagaimana anda melayani gereja?

# registerEmailPasswordRequired
source: Email and password are required
id: Email dan Password wajib diisi

# registerPasswordsNotMatch
source: Passwords do not match
id: Password tidak sama

# registerPasswordMin
source: Password must be at least 6 characters
id: Password minimal 6 karakter

# registerNameRequired
source: Full name is required
id: Nama Lengkap wajib diisi

# registerDobRequired
source: Date of birth is required
id: Tanggal Lahir wajib diisi

# registerMaritalRequired
source: Marital status is required
id: Status Pernikahan wajib dipilih

# registerCountryRequired
source: Country is required
id: Negara wajib dipilih

# registerRoleRequired
source: Please choose your service role
id: Pilih peran pelayanan anda

# registerAgreeTermsRequired
source: You must agree to the Terms & Conditions
id: Anda harus menyetujui Syarat & Ketentuan

# registerFullNameLabel
source: Full name
id: Nama Lengkap

# registerFullNameHint
source: As shown on your ID
id: Sesuai dengan KTP

# registerBaptismNameLabel
source: Baptism name (optional)
id: Nama Baptis (Opsional)

# registerBaptismNameHint
source: Enter baptism name if any
id: Masukkan nama baptis jika ada

# registerDobLabel
source: Date of birth
id: Tanggal Lahir

# registerMaritalStatusLabel
source: MARITAL STATUS
id: STATUS PERNIKAHAN

# registerSelectMaritalStatus
source: Select marital status
id: Pilih Status Pernikahan

# registerEthnicityLabel
source: Ethnicity
id: Suku / Etnis

# registerEthnicityHint
source: Example: Batak, Javanese, Chinese
id: Contoh: Batak, Jawa, Chinese

# registerCountryLabel
source: Country
id: Negara

# registerCountryHint
source: Select country
id: Pilih Negara

# registerDioceseLabel
source: Diocese
id: Keuskupan

# registerDioceseHint
source: Select diocese
id: Pilih Keuskupan

# registerParishLabel
source: Parish church
id: Gereja Paroki

# registerParishHint
source: Select parish church
id: Pilih Gereja Paroki

# registerRoleLabel
source: CHOOSE ROLE
id: PILIH PERAN

# registerRoleUmat
source: Layperson
id: Umat

# registerRolePriest
source: Priest
id: Imam

# registerRoleReligious
source: Religious (brother/sister)
id: Biarawan/wati

# registerRoleCatechist
source: Catechist
id: Katekis

# registerCatechumenLabel
source: I am a catechumen / learning about the Catholic faith
id: Saya calon katekumen / sedang belajar agama Katolik

# registerTermsText
source: I agree to the Terms & Conditions and allow verification of my faith data.
id: Saya menyetujui S&K dan bersedia data iman saya diverifikasi.

# registerPickLabel
source: Select {label}
id: Pilih {label}

# registerCancel
source: Cancel
id: Batal

# registerNext
source: NEXT
id: LANJUT

# registerBack
source: BACK
id: KEMBALI

# registerSubmit
source: SIGN UP
id: DAFTAR

# registerProcessing
source: Processing...
id: Memproses...

# registerStepLabelAccount
source: Account
id: Akun

# registerStepLabelLocation
source: Location
id: Lokasi

# registerStepLabelRole
source: Role
id: Peran

# registerMaritalSingle
source: Never married
id: Belum Pernah Menikah

# registerMaritalWidowed
source: Widowed
id: Cerai Mati

# registerSuccessTitle
source: Registration successful
id: Registrasi Berhasil

# registerSuccessMessage
source: Your account has been created. Please verify your email first, then sign in.
id: Akun Anda telah dibuat. Silakan verifikasi email terlebih dahulu, lalu login kembali.

# registerSuccessAction
source: Go to sign in
id: Masuk Aplikasi

# registerSearchHint
source: Search {label}...
id: Cari {label}...

# profileTitle
source: Profile
id: Profil

# profileEdit
source: Edit profile
id: Edit Profil

# profileShare
source: Share profile
id: Bagikan Profil

# profileUnfollow
source: Following
id: Mengikuti

# profileInviteMass
source: Invite to Mass
id: Ajak Misa

# profileGalleryTab
source: GALLERY
id: GALERI

# profileSavedTab
source: SAVED
id: DISIMPAN

# profileEmptyPosts
source: No posts yet
id: Belum ada postingan

# profileEmptySaved
source: No saved posts
id: Belum ada postingan disimpan

# profileNoProfile
source: Profile not available
id: Profil belum tersedia

# profileRetry
source: Try again
id: Coba lagi

# profileShareMessage
source: Check my profile on MyChatolic! Name: {name} ID: {id}
id: Cek profil saya di MyChatolic! Nama: {name} ID: {id}

# profileBaptismName
source: Baptism name: {name}
id: Nama Baptis: {name}

# profileAge
source: {age} years
id: {age} Tahun

# profileStatsPosts
source: Posts
id: Post

# profileStatsFollowers
source: Followers
id: Pengikut

# profileStatsFollowing
source: Following
id: Mengikuti

# profileVerified
source: Verified
id: Terverifikasi

# profileNotVerified
source: Not verified
id: Belum terverifikasi

# profileVerificationPending
source: Your documents are being reviewed by admin.
id: Dokumen Anda sedang ditinjau oleh Admin.

# profileVerificationNeeded
source: Your account is not verified. Upload documents to unlock full access.
id: Akun belum terverifikasi. Upload dokumen untuk akses fitur penuh.

# profileVerifyAction
source: VERIFY
id: VERIFIKASI

# profileTrustCatholic
source: 100% Catholic
id: 100% Katolik

# profileTrustVerifiedClergy
source: {role} verified
id: {role} Terverifikasi

# profileTrustPending
source: Verification pending
id: Menunggu Verifikasi

# profileTrustCatechumen
source: Catechumen
id: Katekumen

# profileTrustUnverified
source: Not verified
id: Belum Verifikasi

# profileViewBanner
source: View banner
id: Lihat Banner

# profileChangeBanner
source: Change banner
id: Ganti Banner

# profileBannerUnavailable
source: Banner not available
id: Banner belum tersedia

# profileViewPhoto
source: View photo
id: Lihat Foto

# profileChangePhoto
source: Change profile photo
id: Ganti Foto Profil

# a11yChangeBanner
source: Change banner
id: Ganti Banner

# a11yBack
source: Back
id: Kembali

# a11yProfileBanner
source: Profile banner
id: Banner profil

# a11yProfileAvatar
source: Profile photo
id: Foto profil

# a11yChatSearch
source: Search chats
id: Cari chat

# a11yChatCreate
source: Create chat
id: Buat chat

# scheduleTitle
source: Calendar & Mass
id: Kalender & Misa

# scheduleCalendarLabel
source: Calendar
id: Kalender

# scheduleSearchTitle
source: Find Mass schedule
id: Cari Jadwal Misa

# scheduleSearchButton
source: See schedule
id: Lihat Jadwal

# scheduleResetDaily
source: Reset to daily view
id: Reset ke Tampilan Harian

# scheduleResultsChurch
source: Full church schedule
id: Jadwal Lengkap Gereja

# scheduleResultsToday
source: Today's Mass schedule
id: Jadwal Misa Hari Ini

# scheduleLoading
source: Loading schedule...
id: Memuat jadwal...

# scheduleEmptyTitleDaily
source: No schedule yet
id: Belum Ada Jadwal

# scheduleEmptyTitleChurch
source: Schedule not found
id: Jadwal Tidak Ditemukan

# scheduleEmptyMessageDaily
source: No schedule for this date. Use church search below.
id: Tidak ada jadwal untuk tanggal ini. Gunakan pencarian gereja di bawah.

# scheduleEmptyMessageChurch
source: Try another parish or reset to daily view.
id: Coba ganti paroki atau reset ke tampilan harian.

# scheduleRetry
source: Retry
id: Coba Lagi

# schedulePickChurchFirst
source: Please select a church first
id: Pilih Gereja terlebih dahulu

# scheduleLiturgyLoading
source: Loading liturgy info…
id: Memuat info liturgi…

# scheduleLiturgyMissing
source: Liturgy info not available
id: Info liturgi belum tersedia

# scheduleLiturgyColor
source: Liturgy color: {color}
id: Warna Liturgi: {color}

# scheduleReadingUnavailable
source: Reading data not available.
id: Data bacaan belum tersedia.

# scheduleReadingLoading
source: Loading verses.
id: Memuat ayat.

# scheduleReadingError
source: Failed to load verses.
id: Gagal memuat ayat.

# scheduleLegendWhite
source: White
id: Putih

# scheduleLegendRed
source: Red
id: Merah

# scheduleLegendGreen
source: Green
id: Hijau

# scheduleLegendPurple
source: Purple
id: Ungu

# scheduleLegendBlack
source: Black
id: Hitam

# scheduleCachedLiturgyShown
source: Showing saved liturgy.
id: Menampilkan liturgi tersimpan.

# scheduleCachedScheduleShown
source: Connection issue, showing saved schedule.
id: Koneksi bermasalah, menampilkan jadwal tersimpan.

# scheduleCheckInSuccess
source: Check-in successful! See status in Mass Radar.
id: Berhasil Check-in! Lihat status di Radar Misa.

# scheduleLoadErrorTitle
source: Failed to load schedule
id: Gagal memuat jadwal

# scheduleLoadErrorMessage
source: There was an error loading the data.
id: Terjadi kesalahan saat memuat data.

# scheduleSearchChurchButton
source: Find church
id: Cari Gereja

# scheduleFeastFallback
source: Ordinary Time
id: Hari Biasa

# scheduleReadingLabel1
source: First Reading
id: Bacaan 1

# scheduleReadingLabelPsalm
source: Psalm
id: Mazmur

# scheduleReadingLabelGospel
source: Gospel
id: Injil

# scheduleBibleDisabled
source: Bible feature is disabled.
id: Fitur Alkitab dinonaktifkan.

# scheduleActiveLabel
source: ACTIVE
id: AKTIF

# scheduleLanguageGeneral
source: General
id: Umum

# scheduleParishLoading
source: Loading parish...
id: Memuat paroki...

# scheduleParishLoadError
source: Failed to load parish data.
id: Gagal memuat data paroki.

# scheduleParishEmpty
source: Parish data not available.
id: Data paroki belum tersedia.

# scheduleParishScheduleLoading
source: Loading parish schedule...
id: Memuat jadwal paroki...

# scheduleParishScheduleError
source: Failed to load parish schedule.
id: Gagal memuat jadwal paroki.

# scheduleParishHeader
source: Your parish schedule
id: Jadwal Paroki Anda

# scheduleParishEmptySchedule
source: No schedule yet.
id: Belum ada jadwal.

# scheduleParishSetupTitleUpdate
source: Parish schedule not available
id: Jadwal Paroki Belum Tersedia

# scheduleParishSetupTitle
source: Set your parish
id: Atur Paroki Anda

# scheduleParishSetupMessageUpdate
source: Update your profile to see the correct parish schedule.
id: Perbarui profil untuk melihat jadwal paroki yang benar.

# scheduleParishSetupMessage
source: Select your parish in profile to see automatic schedule.
id: Pilih paroki di profil untuk lihat jadwal otomatis.

# scheduleParishSetupAction
source: Set up
id: Atur

# chatTitle
source: Messages
id: Pesan

# chatEmptyTitle
source: No messages yet
id: Belum ada pesan

# chatEmptyMessage
source: Start a new conversation from the + button
id: Mulai percakapan baru dari tombol +

# chatLoadErrorTitle
source: Failed to load chats
id: Gagal memuat chat

# chatLoadErrorMessage
source: Connection issue. Try again.
id: Koneksi bermasalah. Coba lagi.

# chatSessionExpiredTitle
source: Session expired
id: Sesi berakhir

# chatSessionExpiredMessage
source: Please log in again.
id: Silakan login ulang.

# chatDeleteTitle
source: Delete chat?
id: Hapus Chat?

# chatDeleteMessage
source: This conversation will be permanently deleted.
id: Obrolan ini akan dihapus permanen.

# chatDeleteCancel
source: Cancel
id: Batal

# chatDeleteConfirm
source: Delete
id: Hapus

# chatDeleteSuccess
source: Chat deleted successfully
id: Chat berhasil dihapus

# chatDeleteFailed
source: Failed to delete chat.
id: Gagal hapus chat.

# settingsTitle
source: Settings
id: Pengaturan

# settingsAccountSection
source: ACCOUNT
id: AKUN

# settingsSecurityTitle
source: Account security
id: Keamanan Akun

# settingsAnalyticsTitle
source: Analytics (no personal data)
id: Analytics (tanpa data pribadi)

# settingsAnalyticsSubtitle
source: Helps improve the app
id: Membantu peningkatan aplikasi

# settingsLanguageTitle
source: Language
id: Bahasa

# settingsLanguageSubtitle
source: Choose app language
id: Pilih bahasa aplikasi

# settingsGeneralSection
source: GENERAL
id: UMUM

# settingsSecuritySection
source: SECURITY
id: KEAMANAN

# settingsVerifyAccount
source: Verify account
id: Verifikasi Akun

# settingsVerificationPendingShort
source: Pending
id: Menunggu

# settingsLogout
source: Log out
id: Keluar

# settingsVersion
source: Version {version}
id: Versi {version}

# settingsAbout
source: About app
id: Tentang Aplikasi

# settingsHelp
source: Help & support
id: Bantuan & Dukungan

# settingsChangePassword
source: Change password
id: Ubah Kata Sandi

# settingsBlockedUsers
source: Blocked users
id: Pengguna yang Diblokir

# settingsAccountSecuritySubtitle
source: Manage email, phone, password, and sessions
id: Kelola email, nomor HP, password, dan sesi

# settingsEmailResend
source: Resend verification email
id: Kirim ulang verifikasi email

# settingsChangeEmail
source: Change email
id: Ganti email

# settingsEmailNotAvailable
source: Email not available
id: Email tidak tersedia

# settingsEmailSent
source: Verification email sent
id: Email verifikasi dikirim

# settingsInvalidEmail
source: Invalid email format
id: Format email tidak valid

# settingsChangeEmailTitle
source: Change email
id: Ganti Email

# settingsEmailHint
source: name@email.com
id: nama@email.com

# settingsLogoutConfirmTitle
source: Sign out
id: Keluar Akun

# settingsLogoutConfirmMessage
source: Are you sure you want to sign out?
id: Apakah Anda yakin ingin keluar dari aplikasi?

# settingsLogoutButton
source: Sign out
id: Keluar

# settingsLogoutFailed
source: Failed to sign out: {error}
id: Gagal keluar: {error}

# settingsUserNotFound
source: User not found
id: User tidak ditemukan

# settingsLanguageSystem
source: Follow device
id: Ikuti perangkat
